[
    {
        "productAsin": "B0BXRZ3S7W",
        "ratingScore": 5,
        "reviewTitle": "Its hard to find good shapewear.",
        "reviewUrl": "https://www.amazon.com/gp/customer-reviews/RK6UQV2NWPO6K/ref=cm_cr_arp_d_rvw_ttl?ie=UTF8&ASIN=B0BXRZ3S7W",
        "reviewReaction": "One person found this helpful",
        "reviewedIn": "Reviewed in the United States 🇺🇸 on May 16, 2023",
        "date": "2023-05-16",
        "country": "United States",
        "countryCode": "🇺🇸",
        "reviewDescription": "Just that.  I remember the days of the department stores and sifting through oddly shaped and sized store racks for sizes that probably didn't exist and you got whatever colors you could find.  I don't know why department stores thought shapewear should be on those tiny hangers and store racks.Thank goodness for the internet.While there is the issue of sizing, that can usually be figured out with a good measuring tape and size chart.I order a size down for shapewear. It's stretchy and I like the slimmer lines. If you do historical costumes then it fits under the costume like a corset.  Also living in Texas, you have to mitigate your layers with the Texas heat.  If you dress up for anachronism as a job, or on a regular basis, this body suit is still good for waist training. For you, probably get 4 or 5 and wash after each wear to get used to the steady compression of a corset.  Then you can layer the corset over it and the stretchy material gives a layer of protection to your skin and the corset.  If you're a weekender going to a convention or Renaissance festival maybe once or twice a year, this bodysuit is perfect.  The metric is \"Can you eat, drink, sit, and toilet in it comfortably\".  Comfort is so important in all things fashion. Confidence comes out of that comfort. Not trying to say that weekenders shouldn't enjoy wearing a corset, but this bodysuit is a great facsimile if the idea of a corset seems too daunting.The bottom line is if you're going to be wearing shapewear regularly, buy it like you would regular underwear as in 5 at a time. Wash it after each wear to maintain the elastic.  The bodysuit doesn't ride up, the crotch is a reasonable size, with no unfortunate seam up the clam crack. Getting into it or out of it isn't difficult.  The hook and eye closures don't land in an awkward place.Definitely cosplay friendly",
        "isVerified": true,
        "variant": "Size: Small/MediumColor: Black Thong",
        "reviewImages": [],
        "position": 1
    },
    {
        "productAsin": "B0BXRZ3S7W",
        "ratingScore": 5,
        "reviewTitle": "*OBSESSED*",
        "reviewUrl": "https://www.amazon.com/gp/customer-reviews/R1VUQWNZIU1BS6/ref=cm_cr_arp_d_rvw_ttl?ie=UTF8&ASIN=B0BXRZ3S7W",
        "reviewReaction": "255 people found this helpful",
        "reviewedIn": "Reviewed in the United States 🇺🇸 on March 25, 2023",
        "date": "2023-03-25",
        "country": "United States",
        "countryCode": "🇺🇸",
        "reviewDescription": "I don't like shapewear lol. I have worn the ones that are sort of like bike shorts but with more tummy coverage a few times for certain events or outfits and they always pinched and would ride down at the waist, but the shorts would also somehow ride up, I was always super sweaty in them and uncomfortable, they would pinch - it was just an all around bad time. So several years ago, I threw in the towel and just decided I would not deal with it anymore lol. I would wear regular bike shorts under dresses or skirts and otherwise it would be fine.And then I got invited to a fancier event for NYE. And I had a dress to wear already in my closet. But it *needed* shapewear to look how I wanted it to. I went on an Amazon hunt and after many hours of searching and reading reviews - I landed on this one. I got the full body shaper that basically looks like a leotard with shorts lol. I sort of snickered at the idea that I could wear this without a bra - I am a DDD, I didn't even try it without a bra on NYE, just pulled this on right over the bra I was wearing - which worked no problem.The wonderful thing about this shaper is that it actually works how it should. It doesn't ride up or down, it doesn't bunch, it is breathable enough that I don't feel like I am dying - and it smooths everything out and provides protection from chub rub. The shorts are short enough for cocktail dresses - and it is easy enough to pull them shorter if need be and adjust the shaper accordingly. I danced the night away, and drank way too much at the after-after party in this shaper lol. And didn't feel uncomfortable once.Now, the fun part - I decided to try wearing this to go out with the girls a few weekends ago with some jeans and a vest that I have always wanted to wear as a shirt - but never felt I could get away with it with my chest. This shaper *actually* worked with my chest. Was it as supportive as a \"proper\" bra with an underwire? No. Was it more supportive than a bralette? Hell yeah - seriously *so* much better than a bralette. No sagging or weird uni-boob! I loved the amount of support it gave me actually. it looked great with jeans and my vest-as-a-shirt also, but I was so jazzed about how genuinely comfortable I was in it which I never would have actually believed was possible for a bodyshaper.Since then, I have worn it at least 3 other times, to work, or to go out with friends. I've worn it to dinner and had a full meal with no issues, I have sat in the office all day in it and not been uncomfortable. And it gives me such a nice level of support without being restrictive at all. I move around a lot lol - and this doesn't impact me at all. I literally have sometimes forgotten I had it on until I went to use the restroom lol.The only *tiny* thing that I haven't 100% loved about it - is that the bust line is a little high (especially if you are tightening the straps to get as much support as you can lol) so the shaper sometimes would peep out the top of my shirt a bit which I would have liked if it was low enough that didn't happen and so I could get some proper cleavage lol. But overall I adore it and will probably see if there are other necklines by this brand to try out.",
        "isVerified": true,
        "variant": "Size: 2XL/3XLColor: Beige Mid Thigh",
        "reviewImages": [],
        "position": 2
    },
    {
        "productAsin": "B0BXRZ3S7W",
        "ratingScore": 4,
        "reviewTitle": "Works well, just a few areas of improvement needed",
        "reviewUrl": "https://www.amazon.com/gp/customer-reviews/RNVC4FK2HOTU5/ref=cm_cr_arp_d_rvw_ttl?ie=UTF8&ASIN=B0BXRZ3S7W",
        "reviewReaction": "8 people found this helpful",
        "reviewedIn": "Reviewed in the United States 🇺🇸 on May 14, 2023",
        "date": "2023-05-14",
        "country": "United States",
        "countryCode": "🇺🇸",
        "reviewDescription": "Ok, I’ll start off with I recommend this!Attached you will find with and without pic. I had absolutely no challenges getting this on ( makes me wonder if I need a smaller size). Now the pros you can see in the pic, it smooths our the “lumps” what I removed a star was for the strap marking on my shoulders and the back (thong) lining is visible through clothing. Also it is a little to long for my body.. although you can adjust the straps up top… I feel like I need to make it smaller /shorter by pulling down below… Otherwise, the top portion of the bodysuit becomes more visible under your top as I gets closer to your neck line. Because it’s a little bit longer I do feel more pressure on my waist line where the extra material crinkles up. I wore this for approx 8 hours and besides straps, all was comfortableI would prefer black, so I may purchase the shorts version in black.Overall, I’m glad I purchased, I can get past the issues.",
        "isVerified": true,
        "variant": "Size: Small/MediumColor: Beige Thong",
        "reviewImages": [
            "https://m.media-amazon.com/images/I/714ufmiWEWL._SY88.jpg",
            "https://m.media-amazon.com/images/I/71GiRoLNiNL._SY88.jpg",
            "https://m.media-amazon.com/images/I/71LDbiI8cLL._SY88.jpg",
            "https://m.media-amazon.com/images/I/71e80Q3+SqL._SY88.jpg"
        ],
        "position": 3
    },
    {
        "productAsin": "B0BXRZ3S7W",
        "ratingScore": 4,
        "reviewTitle": "Good for hiding those rolls",
        "reviewUrl": "https://www.amazon.com/gp/customer-reviews/R13W8UTGFVDA5J/ref=cm_cr_arp_d_rvw_ttl?ie=UTF8&ASIN=B0BXRZ3S7W",
        "reviewReaction": "37 people found this helpful",
        "reviewedIn": "Reviewed in the United States 🇺🇸 on May 4, 2023",
        "date": "2023-05-04",
        "country": "United States",
        "countryCode": "🇺🇸",
        "reviewDescription": "I am not providing no before and after picture because don't nobody want to see all that before! This shaper is not going to make you skinny however, it will hide any rolls you have,flatten them out for you and make your body not look so lumpy which is great and make you feel a lot better when going out. I would not recommend going out drinking (which I do every time I wear it) but if you do, just plan on being in the bathroom and extra 5 minutes. The strap at the crotch is the same strap that is on our typical bras so it takes a minute to get it on and off.... Especially the more you drink. The shaper has no breast pads so I just slid a couple from my other bras in there. It's definitely worth the buy because it will make you look and feel better. It is very stretchy so it is kind of hard to order the wrong size. I am 5'2 167 lb and I ordered a small.",
        "isVerified": true,
        "variant": "Size: Small/MediumColor: Black Thong",
        "reviewImages": [],
        "position": 4
    },
    {
        "productAsin": "B0BXRZ3S7W",
        "ratingScore": 5,
        "reviewTitle": "It’s A Miracle!!!!",
        "reviewUrl": "https://www.amazon.com/gp/customer-reviews/RQ0CK4A76N2Z4/ref=cm_cr_arp_d_rvw_ttl?ie=UTF8&ASIN=B0BXRZ3S7W",
        "reviewReaction": "5 people found this helpful",
        "reviewedIn": "Reviewed in the United States 🇺🇸 on May 12, 2023",
        "date": "2023-05-12",
        "country": "United States",
        "countryCode": "🇺🇸",
        "reviewDescription": "OMG!  I love, love, love this product!!!!Thank you to all who left a review🙏🏽 You were spot on! I am 5’1” and currently weigh 189 lbs. (quickly losing for my European trip in July)…. nevertheless, I ordered a S/M based on the other customer reviews. I cannot tell you how much I love this product. Not only does it look good on me, it feels.AMAZING!!!! I questioned the feel of the thong; but trust me, it is so comfortable that I am now ordering five more pieces.  I want to be able to wear one every day while on vacation. I forgot to say that I am a 40DDD and the bra coverage and support is outstanding😘. In my lifetime, I have never been able to go braless and now I am privileged, and very happy to do so!!! There is a little jiggle, but not enough to be unladylike. PRAISE GOD for your PHENOMINAL product!  If I had 10 million tongues, they would not be enough to praise this product. This Shape R/X is “What’s Up”!!!Thank you🙏🏽",
        "isVerified": true,
        "variant": "Size: Small/MediumColor: Black Brief",
        "reviewImages": [],
        "position": 5
    },
    {
        "productAsin": "B0BXRZ3S7W",
        "ratingScore": 4,
        "reviewTitle": "10/10",
        "reviewUrl": "https://www.amazon.com/gp/customer-reviews/R196XK9WWEEFYA/ref=cm_cr_arp_d_rvw_ttl?ie=UTF8&ASIN=B0BXRZ3S7W",
        "reviewReaction": "79 people found this helpful",
        "reviewedIn": "Reviewed in the United States 🇺🇸 on May 5, 2023",
        "date": "2023-05-05",
        "country": "United States",
        "countryCode": "🇺🇸",
        "reviewDescription": "When this first came in I thought to myself \"yeah, how is my 5'4\"- 196lb butt gonna fit in this... I bought an l/xl thinking it's be good... but I was worried. The stretch was there so I decided to grab her by the sides and give her a go... a few good tugs and some shimmy shakes and I'm in. Now, I thought I ordered the full back version and I got the thong- so you won't get a rear pic... but it fits. It actually fits. I'm not sure what witchcraft this is but I'm here for it. It's comfortable and definitely slimming! All I can think of is the sturdy cans that hold the Cresent roll dough on... yeah that's this. Lord help me when it is time to come off... but for now we are good!Downside? The edges at the bottom do roll a little so I'm not impressed with that, but everything else is good! 👌🏻",
        "isVerified": true,
        "variant": "Size: L/XLColor: Beige Thong",
        "reviewImages": [
            "https://m.media-amazon.com/images/I/61JrLcIu3WL._SY88.jpg",
            "https://m.media-amazon.com/images/I/61cEoOlVgQL._SY88.jpg"
        ],
        "position": 6
    },
    {
        "productAsin": "B0BXRZ3S7W",
        "ratingScore": 4,
        "reviewTitle": "Wide Hips? Prepare for a Wedgie",
        "reviewUrl": "https://www.amazon.com/gp/customer-reviews/R2AT0NTBHRI5JY/ref=cm_cr_arp_d_rvw_ttl?ie=UTF8&ASIN=B0BXRZ3S7W",
        "reviewReaction": "48 people found this helpful",
        "reviewedIn": "Reviewed in the United States 🇺🇸 on April 17, 2023",
        "date": "2023-04-17",
        "country": "United States",
        "countryCode": "🇺🇸",
        "reviewDescription": "Here's a note to all my wide hip girlies: be prepared for a wedgie and wear solid underwear underneath to prevent chaffing.I love this thong bodysuit. It really pulls me in and lets me hide my 30 something mom fupa when I'm around my young 20 something co-workers. Because I've had a child, I've got them birthing hips. If I was letting this body suit hit where it wanted to I'd cut my love handles in half and it would inevitably roll up. I let the bikini cut of this pull up above my meat handles and it looks like I'm snatched in all the ways I want to be. I followed the advice and sized down, usually I'm a large but because I was looking for compression I got a medium and it was perfect.Oh, and the boobs. Unless you got silicone in them boobies to combat the compression, you're going to look flat but nips a-blazing. I wear a bra underneath and notice that I still don't have my normal full bust. My full C goes to an A, know what I mean?All in all, would buy again, will buy again in black.",
        "isVerified": true,
        "variant": "Size: Small/MediumColor: Beige Thong",
        "reviewImages": [],
        "position": 7
    },
    {
        "productAsin": "B0BXRZ3S7W",
        "ratingScore": 4,
        "reviewTitle": "2XL - 3XL REVIEW",
        "reviewUrl": "https://www.amazon.com/gp/customer-reviews/R39E92FR0GKXK0/ref=cm_cr_arp_d_rvw_ttl?ie=UTF8&ASIN=B0BXRZ3S7W",
        "reviewReaction": "13 people found this helpful",
        "reviewedIn": "Reviewed in the United States 🇺🇸 on April 30, 2023",
        "date": "2023-04-30",
        "country": "United States",
        "countryCode": "🇺🇸",
        "reviewDescription": "I wear a XL & 14 - 16. This is NOT a miracle worker - but it does help. It mainly just smooths  you out. If you have a stomach like I do - it WONT hide it, just smooth it out. The sides do ride up, especially if you have a hourglass/smaller waist body type. I like it, the top can be worn by itself as a top if you’d like. It looks quality and it’s as comfortable as a thong body suit can be.Overall would recommend. I assume most things on Amazon need to be sized up if not “plus” but I’d measure and make sure bc this mainly depends on body type and size. I did size up and am pleased with. A size down would be suffocating and probably ill fitting.",
        "isVerified": true,
        "variant": "Size: 2XL/3XLColor: Black Thong",
        "reviewImages": [],
        "position": 8
    },
    {
        "productAsin": "B0BXRZ3S7W",
        "ratingScore": 4,
        "reviewTitle": "This was the closest product that I could find to what I was looking for.",
        "reviewUrl": "https://www.amazon.com/gp/customer-reviews/R2H75QVQ6U7ZPS/ref=cm_cr_arp_d_rvw_ttl?ie=UTF8&ASIN=B0BXRZ3S7W",
        "reviewReaction": "5 people found this helpful",
        "reviewedIn": "Reviewed in the United States 🇺🇸 on April 18, 2023",
        "date": "2023-04-18",
        "country": "United States",
        "countryCode": "🇺🇸",
        "reviewDescription": "I like the gorgeous pink color, the thong styling, and the hooked clasps at the crotch. I do not like the overly-spandexed fabric because it pills and chafes when it rubs against other clothing. Also,  you cannot wear a thong or leggings under it because it exaggerates every bulge that these other clothes create. Maybe I should have ordered a size or two up. So hindsight is 20/20 and I cannot  return it due to that it is obviously used after minimum wear, and I cannot order a larger one because the high price broke my budget for sexy clothing in the near future. Still, this is the closest garment that I could find to what I was looking for and I am sure that it will get some use before it's ready for the trash.",
        "isVerified": true,
        "variant": "Size: L/XLColor: Pink Thong",
        "reviewImages": [
            "https://m.media-amazon.com/images/I/71MahMHngFL._SY88.jpg"
        ],
        "position": 9
    },
    {
        "productAsin": "B0BXRZ3S7W",
        "ratingScore": 4,
        "reviewTitle": "Nice for everyday use - size L/XL",
        "reviewUrl": "https://www.amazon.com/gp/customer-reviews/R2HTVZESAD4POJ/ref=cm_cr_arp_d_rvw_ttl?ie=UTF8&ASIN=B0BXRZ3S7W",
        "reviewReaction": "",
        "reviewedIn": "Reviewed in the United States 🇺🇸 on May 12, 2023",
        "date": "2023-05-12",
        "country": "United States",
        "countryCode": "🇺🇸",
        "reviewDescription": "Looks very nice on, my favorite part is the breast area. I’m a 38DD so it can be a challenge finding the perfect bra / shape wear to hold my boobs in place. This fits the breast area perfectly , no bra or extra support needed and it’s super comfortable. Only thing is this does not hold you in an extreme amount. It smooths you out and would look nice under clothes but being 4 months postpartum I want something more snug to hide my mommy pooch. Very nice otherwise though. Definitely size up.",
        "isVerified": true,
        "variant": "Size: L/XLColor: Beige Thong",
        "reviewImages": [],
        "position": 10
    },
    {
        "productAsin": "B0BXRZ3S7W",
        "ratingScore": 5,
        "reviewTitle": "Wow",
        "reviewUrl": "https://www.amazon.com/gp/customer-reviews/R3NIG6BX04K2D1/ref=cm_cr_arp_d_rvw_ttl?ie=UTF8&ASIN=B0BXRZ3S7W",
        "reviewReaction": "",
        "reviewedIn": "Reviewed in the United States 🇺🇸 on May 10, 2023",
        "date": "2023-05-10",
        "country": "United States",
        "countryCode": "🇺🇸",
        "reviewDescription": "Just like on TikTok you look at it and think \"how in Gods name is this going to fit me?\"  But it does!!!  Super slimming and soft.  Of course, despite the softness of the material, it isn't the most comfortable thing in the world...but what shapewear is?  Ive gained much more weight over the last few years than I'd like to admit so this helps me to feel more confident.  Definitely follow the size chart when ordering!",
        "isVerified": true,
        "variant": "Size: Small/MediumColor: Black Thong",
        "reviewImages": [],
        "position": 31
    },
    {
        "productAsin": "B0BXRZ3S7W",
        "ratingScore": 4,
        "reviewTitle": "Great",
        "reviewUrl": "https://www.amazon.com/gp/customer-reviews/RW6YQ3WDLQ21H/ref=cm_cr_arp_d_rvw_ttl?ie=UTF8&ASIN=B0BXRZ3S7W",
        "reviewReaction": "",
        "reviewedIn": "Reviewed in the United States 🇺🇸 on May 15, 2023",
        "date": "2023-05-15",
        "country": "United States",
        "countryCode": "🇺🇸",
        "reviewDescription": "I bought this for some tummy control. It does help with smoothing, the tummy control is there but not stellar. I think for the price it works great, plus you can wear it on its own as a bodysuit.",
        "isVerified": true,
        "variant": "Size: Small/MediumColor: Black Thong",
        "reviewImages": [],
        "position": 32
    },
    {
        "productAsin": "B0BXRZ3S7W",
        "ratingScore": 4,
        "reviewTitle": "It’s Amazon Shapewear …",
        "reviewUrl": "https://www.amazon.com/gp/customer-reviews/R3EQJE9FPNM3CB/ref=cm_cr_arp_d_rvw_ttl?ie=UTF8&ASIN=B0BXRZ3S7W",
        "reviewReaction": "",
        "reviewedIn": "Reviewed in the United States 🇺🇸 on April 18, 2023",
        "date": "2023-04-18",
        "country": "United States",
        "countryCode": "🇺🇸",
        "reviewDescription": "So I recently purchased a mesh dress and was looking for a slip to go underneath. I’ve never purchased or worn shapewear before, so I really didn’t know what to look for. I’m satisfied with this product, it fit and functioned as advertised. It smoothed out my curves and keeps my tummy tight. The material, while soft and supple against the skin, is pretty thin and borderline flimsy. I expect to get 3-5 good wears out of this before it becomes non-functional.",
        "isVerified": true,
        "variant": "Size: Small/MediumColor: Beige Thong",
        "reviewImages": [],
        "position": 33
    },
    {
        "productAsin": "B0BXRZ3S7W",
        "ratingScore": 4,
        "reviewTitle": "Fits but sheer",
        "reviewUrl": "https://www.amazon.com/gp/customer-reviews/R1PU091JNQTYI4/ref=cm_cr_arp_d_rvw_ttl?ie=UTF8&ASIN=B0BXRZ3S7W",
        "reviewReaction": "",
        "reviewedIn": "Reviewed in the United States 🇺🇸 on May 9, 2023",
        "date": "2023-05-09",
        "country": "United States",
        "countryCode": "🇺🇸",
        "reviewDescription": "I was surprised that the small/medium fit, it arrived looking tiny. I also have a large chest but it works. My two complaints are I wish the color was more tan, it was more yellowish. Also very sheer in the chest area. Will have to wear a bra underneath.",
        "isVerified": true,
        "variant": "Size: Small/MediumColor: Beige Thong",
        "reviewImages": [],
        "position": 34
    },
    {
        "productAsin": "B0BXRZ3S7W",
        "ratingScore": 5,
        "reviewTitle": "Small out of the box, but fits like a glove",
        "reviewUrl": "https://www.amazon.com/gp/customer-reviews/R2R1CWORQRLI8Y/ref=cm_cr_arp_d_rvw_ttl?ie=UTF8&ASIN=B0BXRZ3S7W",
        "reviewReaction": "2 people found this helpful",
        "reviewedIn": "Reviewed in the United States 🇺🇸 on April 19, 2023",
        "date": "2023-04-19",
        "country": "United States",
        "countryCode": "🇺🇸",
        "reviewDescription": "BUY it!  Seriously it looks like a Childs leotard when you first get it and as others said, I was skeptical.  It takes a little effort to get it on but it seriously it fit like a glove and was COMFORTABLE!!!  It was surprising supportive in the bust area.  The only thing that would make it better would be if there was padding in the cups.  I bought this to wear under a bridesmaid dress but I might wear it even more!  It does have a cut out for peeing, not sure how that will work.  For reference I am 5'4\", about 180lbs, 38 bust, 33 waist, 42 hips and I got the medium for a snug and supportive fit.",
        "isVerified": true,
        "variant": "Size: Small/MediumColor: Beige Mid Thigh",
        "reviewImages": [],
        "position": 35
    },
    {
        "productAsin": "B0BXRZ3S7W",
        "ratingScore": 4,
        "reviewTitle": "Lived up to the hype!",
        "reviewUrl": "https://www.amazon.com/gp/customer-reviews/RADGQBVNP410S/ref=cm_cr_arp_d_rvw_ttl?ie=UTF8&ASIN=B0BXRZ3S7W",
        "reviewReaction": "",
        "reviewedIn": "Reviewed in the United States 🇺🇸 on April 11, 2023",
        "date": "2023-04-11",
        "country": "United States",
        "countryCode": "🇺🇸",
        "reviewDescription": "My clothes definitely fit looser under this without much chest or booty compression. The hook n eye closure was so much easier to do then others with snaps and two settings accommodated my height. Would definitely recommend unless you’re like me with sensitive skin at your bikini line. Material and stitching was fine but the pressure on my bikini line was irritating like razor rash. No issues elsewhere, definitely a me issue but if prone to the same sensitivity then be aware. 6hrs was too long but will try again for shorter events.",
        "isVerified": true,
        "variant": "Size: Small/MediumColor: Beige Brief",
        "reviewImages": [],
        "position": 36
    },
    {
        "productAsin": "B0BXRZ3S7W",
        "ratingScore": 4,
        "reviewTitle": "US 18/20 fits 4XL/5XL",
        "reviewUrl": "https://www.amazon.com/gp/customer-reviews/RPI0WZEWJ1FW8/ref=cm_cr_arp_d_rvw_ttl?ie=UTF8&ASIN=B0BXRZ3S7W",
        "reviewReaction": "83 people found this helpful",
        "reviewedIn": "Reviewed in the United States 🇺🇸 on March 15, 2023",
        "date": "2023-03-15",
        "country": "United States",
        "countryCode": "🇺🇸",
        "reviewDescription": "I am a solid 18 in most US brands.  I ordered this in the 4XL/5XL.  This fit as expected. It’s definitely a shaper to create curves and has a lot of compression. It’s more than just a smoother.  Material is a little thicker than most silky style shape wear.  It’s more thin sweater type feeling.  This will look TINY when it comes out of the package but trust the process bc it’s stretchy lol. The beige matched my skin tone pretty well too.  Only con I have for this is the chest area. I am a 42DD and this gave me the dreaded smooshed uni-boob similar to a strong sports bra.  Doesn’t shape the melons in the least bit.  I extended the straps out and slip the chest part under my bra and it works fine.",
        "isVerified": true,
        "variant": "Size: 4XL/5XLColor: Beige Mid Thigh",
        "reviewImages": [],
        "position": 37
    },
    {
        "productAsin": "B0BXRZ3S7W",
        "ratingScore": 4,
        "reviewTitle": "Skims or nah",
        "reviewUrl": "https://www.amazon.com/gp/customer-reviews/R2K7DIGH15I0GG/ref=cm_cr_arp_d_rvw_ttl?ie=UTF8&ASIN=B0BXRZ3S7W",
        "reviewReaction": "",
        "reviewedIn": "Reviewed in the United States 🇺🇸 on May 15, 2023",
        "date": "2023-05-15",
        "country": "United States",
        "countryCode": "🇺🇸",
        "reviewDescription": "This body suit is good, good compression yet not painful like most , the sizing is weird definitely measure yourself & size up for the best fit",
        "isVerified": true,
        "variant": "Size: 2XL/3XLColor: Black Thong",
        "reviewImages": [],
        "position": 38
    },
    {
        "productAsin": "B0BXRZ3S7W",
        "ratingScore": 5,
        "reviewTitle": "So comfortable and back rolls are GONE!",
        "reviewUrl": "https://www.amazon.com/gp/customer-reviews/R2YITLKW2KQVVK/ref=cm_cr_arp_d_rvw_ttl?ie=UTF8&ASIN=B0BXRZ3S7W",
        "reviewReaction": "",
        "reviewedIn": "Reviewed in the United States 🇺🇸 on April 25, 2023",
        "date": "2023-04-25",
        "country": "United States",
        "countryCode": "🇺🇸",
        "reviewDescription": "GIRL WHEN I TELL YOU IM SHOOKED IAM!!!! I was so skeptical because i buy and buy shapeware and it’s always disappointing but GIRL THIS ONE RIGHT HERE IS THE ONE AND EVEN BETTER IS SO COMFORTABLE!!! Iam definitely buy more! I got the black thong one, iam 5’1” around 170 and u got size S/M and it fits perfect because it has great stretch! iam 8 months postpartum so I definitely have the mommy pouch and this shapeware smooth everything out now my jeans fit perfect and my back rolls are FREAKING GONE! Run and get this cus is AMAZING",
        "isVerified": true,
        "variant": "Size: Small/MediumColor: Black Thong",
        "reviewImages": [],
        "position": 39
    },
    {
        "productAsin": "B0BXRZ3S7W",
        "ratingScore": 4,
        "reviewTitle": "Does the job but kind of poorly",
        "reviewUrl": "https://www.amazon.com/gp/customer-reviews/R3KDB9PO7N8SFY/ref=cm_cr_arp_d_rvw_ttl?ie=UTF8&ASIN=B0BXRZ3S7W",
        "reviewReaction": "One person found this helpful",
        "reviewedIn": "Reviewed in the United States 🇺🇸 on April 13, 2023",
        "date": "2023-04-13",
        "country": "United States",
        "countryCode": "🇺🇸",
        "reviewDescription": "If you aren't sitting down, the product works great. If you're moving around and sitting down, it's starts to ride up and not hold your shape. The other issue I have is no lining in the bust. It would have been great if you could wear this product under a jacket or by itself but it's not designed for that. So this is definitely a product solely for wearing underneath an outfit. You'll be doing a lot of adjusting if you're up and down.",
        "isVerified": true,
        "variant": "Size: Small/MediumColor: Beige Thong",
        "reviewImages": [],
        "position": 40
    },
    {
        "productAsin": "B0BXRZ3S7W",
        "ratingScore": 4,
        "reviewTitle": "Not enough colors ! We need more variety",
        "reviewUrl": "https://www.amazon.com/gp/customer-reviews/R1EHYTVER3VZYJ/ref=cm_cr_arp_d_rvw_ttl?ie=UTF8&ASIN=B0BXRZ3S7W",
        "reviewReaction": "4 people found this helpful",
        "reviewedIn": "Reviewed in the United States 🇺🇸 on May 2, 2023",
        "date": "2023-05-02",
        "country": "United States",
        "countryCode": "🇺🇸",
        "reviewDescription": "I absolutely love this body suit and wish there were more colors ! So far I have bought most the colors they have with the exception of tan , it just doesn’t go well with it skin tone and seems a bit cheap . I also don’t care for the pink one .. I think it’s the quality ! In black it looks more expensive. The black one is my go to for sure! I wouldn’t size up as the point so to be tight maybe size one size down ! Some of us want to feel kept it 🔥",
        "isVerified": true,
        "variant": "Size: Small/MediumColor: Black Thong",
        "reviewImages": [],
        "position": 11
    },
    {
        "productAsin": "B0BXRZ3S7W",
        "ratingScore": 4,
        "reviewTitle": "It’s Good",
        "reviewUrl": "https://www.amazon.com/gp/customer-reviews/R29RAUZVIPW2GL/ref=cm_cr_arp_d_rvw_ttl?ie=UTF8&ASIN=B0BXRZ3S7W",
        "reviewReaction": "11 people found this helpful",
        "reviewedIn": "Reviewed in the United States 🇺🇸 on April 16, 2023",
        "date": "2023-04-16",
        "country": "United States",
        "countryCode": "🇺🇸",
        "reviewDescription": "Purchased this after pouring over tons of reviews. Finally decided to get this one because I loved the pink color and was hoping I could wear it as a top. Unfortunately, it is see-thru but the compression is good. I felt smooth and pulled in. Is it taking inches of my waist? No, but it is smoothing out the rolls I have. A big issues for many might be the hip area that rides up and can leave you with weird indentations in your hip/rear area. It did not bother me but I could see how on others it would be a deal breaker. I honestly would give this 5 stars but it got a snag on it the second time I wore it.",
        "isVerified": true,
        "variant": "Size: Small/MediumColor: Pink Thong",
        "reviewImages": [],
        "position": 12
    },
    {
        "productAsin": "B0BXRZ3S7W",
        "ratingScore": 4,
        "reviewTitle": "Love",
        "reviewUrl": "https://www.amazon.com/gp/customer-reviews/R16416BPNFLYGN/ref=cm_cr_arp_d_rvw_ttl?ie=UTF8&ASIN=B0BXRZ3S7W",
        "reviewReaction": "45 people found this helpful",
        "reviewedIn": "Reviewed in the United States 🇺🇸 on April 4, 2023",
        "date": "2023-04-04",
        "country": "United States",
        "countryCode": "🇺🇸",
        "reviewDescription": "I caved and bought the thong bodysuit after seeing all the ads. It does suck you in well and snatch your waist! I like that it is not as tight as regular shape wear so it is pretty comfortable to wear.  I also really like that the crotch part is not as tight as the rest so it is not uncomfortable. The hooks are like bra hooks which strangely are easier for me to hook than the normal buttons! I’m about 5’9 170lbs size 34 DD and I ordered the S/M which fits but I might order another color to try in a larger size. You don’t need to wear a bra with this which is nice, but I wore a bra with it the other day and it was great! Had to wear a cardigan because the back is low. The only thing I don’t love about this bodysuit is how far in it comes near the armpits.",
        "isVerified": true,
        "variant": "Size: Small/MediumColor: Black Thong",
        "reviewImages": [],
        "position": 13
    },
    {
        "productAsin": "B0BXRZ3S7W",
        "ratingScore": 4,
        "reviewTitle": "LOVE LOVE LOVE",
        "reviewUrl": "https://www.amazon.com/gp/customer-reviews/ROIHUD5U622IC/ref=cm_cr_arp_d_rvw_ttl?ie=UTF8&ASIN=B0BXRZ3S7W",
        "reviewReaction": "",
        "reviewedIn": "Reviewed in the United States 🇺🇸 on May 14, 2023",
        "date": "2023-05-14",
        "country": "United States",
        "countryCode": "🇺🇸",
        "reviewDescription": "When I tell you this makes me feel so confident I’m not lying. Started gaining weight and hating my wardrobe, now with this on I love it. I didn’t get the thong but it’s still pretty uncomfortable down there. If you plan on wearing it for more than an hour it gets really rough. But I look so good in it I’d buy another one!",
        "isVerified": true,
        "variant": "Size: Small/MediumColor: Black Brief",
        "reviewImages": [],
        "position": 14
    },
    {
        "productAsin": "B0BXRZ3S7W",
        "ratingScore": 4,
        "reviewTitle": "Nice, but no support",
        "reviewUrl": "https://www.amazon.com/gp/customer-reviews/R155EE8AZ1EGH5/ref=cm_cr_arp_d_rvw_ttl?ie=UTF8&ASIN=B0BXRZ3S7W",
        "reviewReaction": "6 people found this helpful",
        "reviewedIn": "Reviewed in the United States 🇺🇸 on April 24, 2023",
        "date": "2023-04-24",
        "country": "United States",
        "countryCode": "🇺🇸",
        "reviewDescription": "I measured myself before ordering. All my measurements were spot on with what I ordered according to the chart. I ususlly take a 14/16 pants and 1X top. I thought 2x/3x would be kind of big but I went with what the sizing chart said. This didn't fit my chest at all. The cups were way too small and there was no support at all. The construction was good. No stray stitching or anything. It would be worth the money if it fit. It made my butt look good, too. But this is not designed for people with a larger chest.",
        "isVerified": true,
        "variant": "Size: 2XL/3XLColor: Beige Mid Thigh",
        "reviewImages": [],
        "position": 15
    },
    {
        "productAsin": "B0BXRZ3S7W",
        "ratingScore": 4,
        "reviewTitle": "Snatched",
        "reviewUrl": "https://www.amazon.com/gp/customer-reviews/R135V88HNMOD1D/ref=cm_cr_arp_d_rvw_ttl?ie=UTF8&ASIN=B0BXRZ3S7W",
        "reviewReaction": "81 people found this helpful",
        "reviewedIn": "Reviewed in the United States 🇺🇸 on March 23, 2023",
        "date": "2023-03-23",
        "country": "United States",
        "countryCode": "🇺🇸",
        "reviewDescription": "I bought this garment for compression wear to help reel back my post baby tummy.Positives: totally snatched the waist and slimmed flanks (love handles) and back rolls. I have a short waist (5 foot 1) and 179 lbs so I did order the L/XL and it fit well. Adjustable bra straps held up the garment and kept it in place for 10 hour day. Over all comfort 7/10 for something with this much compression.Negatives: I am short waisted so the thong portion came up my back a bit and sort of rolled at the top of each hip/booty cheek. Had to be adjusted during the day. Bra was not lined so to hide nipples either use a bra insert or wear normal bra under this, it is stretchy enough for either. Crotch was awkward to clip back together in restroom, thong was a tad uncomfortable due to the wideness of the band that goes between butt cheeks. Shoulder straps a bit cheap so they dug in.Over all good price for compression garment compared to higher priced brand names. If you have a mommy tummy and want something to help suck it back in under dresses and slacks try this one. Worth the price.",
        "isVerified": true,
        "variant": "Size: L/XLColor: Beige Thong",
        "reviewImages": [],
        "position": 16
    },
    {
        "productAsin": "B0BXRZ3S7W",
        "ratingScore": 4,
        "reviewTitle": "The best so far but..",
        "reviewUrl": "https://www.amazon.com/gp/customer-reviews/R3SC2N9LPH37GZ/ref=cm_cr_arp_d_rvw_ttl?ie=UTF8&ASIN=B0BXRZ3S7W",
        "reviewReaction": "59 people found this helpful",
        "reviewedIn": "Reviewed in the United States 🇺🇸 on April 11, 2023",
        "date": "2023-04-11",
        "country": "United States",
        "countryCode": "🇺🇸",
        "reviewDescription": "These things are all the rave now, so I caved. I have a lot of fluff that I wanted squeezed in... it didn't snatch as much in my midsection as I was hoping, but I don't think there's a body suit out there that will. It was a great material, (mostly) comfortable, and it did a great job of shaping my chest!To note: I went with the thong.... I do NOT recommend the thong unless you are a common thong wearer. That thing slid so far up by crack it was coming out my mouth. Additionally, because it rode up so much, the sides would roll up over my hips and gave me a HELL of a muffin top. This suit is probably dang good for the smaller ladies.",
        "isVerified": true,
        "variant": "Size: Small/MediumColor: Black Thong",
        "reviewImages": [],
        "position": 17
    },
    {
        "productAsin": "B0BXRZ3S7W",
        "ratingScore": 4,
        "reviewTitle": "Game Changer!! Order 1 size down!",
        "reviewUrl": "https://www.amazon.com/gp/customer-reviews/R10G39UN61W3NK/ref=cm_cr_arp_d_rvw_ttl?ie=UTF8&ASIN=B0BXRZ3S7W",
        "reviewReaction": "3 people found this helpful",
        "reviewedIn": "Reviewed in the United States 🇺🇸 on April 19, 2023",
        "date": "2023-04-19",
        "country": "United States",
        "countryCode": "🇺🇸",
        "reviewDescription": "I have been on the hint for shape wear for a while. This one is awesome. It's comfortable, easy to put on lightweight and breathable. For the first time since I've gained 30 lbs u have felt confident in wearing a body con type dress. I love this bodysuit and will be ordering more.I got the thong style in black. AND NO BRA NEEDED.***ORDER ONE SIZE SMALLER THAN YOU USUALLY WEAR***I am 177 lbs 5 ft 5 and usually wear a 10 to 12 and size large to xl tops. And I ordered the small medium based off previous reviews I read.",
        "isVerified": true,
        "variant": "Size: Small/MediumColor: Black Thong",
        "reviewImages": [],
        "position": 18
    },
    {
        "productAsin": "B0BXRZ3S7W",
        "ratingScore": 4,
        "reviewTitle": "I can see myself wearing it multiple times",
        "reviewUrl": "https://www.amazon.com/gp/customer-reviews/R1IE933CBRE9AN/ref=cm_cr_arp_d_rvw_ttl?ie=UTF8&ASIN=B0BXRZ3S7W",
        "reviewReaction": "One person found this helpful",
        "reviewedIn": "Reviewed in the United States 🇺🇸 on May 11, 2023",
        "date": "2023-05-11",
        "country": "United States",
        "countryCode": "🇺🇸",
        "reviewDescription": "So I ordered this today because I have a cruise i’m getting ready to go home.  I definitely agree with a lot of the other reviews. It does not make your stomach completely flat if you’re or a little bit overweight, but it does smooth it out and not make you look. So bloated. So far it does appear to be very comfortable.",
        "isVerified": true,
        "variant": "Size: L/XLColor: Beige Thong",
        "reviewImages": [
            "https://m.media-amazon.com/images/I/71I7wkjmrCL._SY88.jpg",
            "https://m.media-amazon.com/images/I/71lf92V1v0L._SY88.jpg",
            "https://m.media-amazon.com/images/I/71y0TdsDzyL._SY88.jpg",
            "https://m.media-amazon.com/images/I/71zXkSghEpL._SY88.jpg"
        ],
        "position": 19
    },
    {
        "productAsin": "B0BXRZ3S7W",
        "ratingScore": 4,
        "reviewTitle": "SNATCHED!!",
        "reviewUrl": "https://www.amazon.com/gp/customer-reviews/R2RIQ2PKDSOBZG/ref=cm_cr_arp_d_rvw_ttl?ie=UTF8&ASIN=B0BXRZ3S7W",
        "reviewReaction": "6 people found this helpful",
        "reviewedIn": "Reviewed in the United States 🇺🇸 on April 27, 2023",
        "date": "2023-04-27",
        "country": "United States",
        "countryCode": "🇺🇸",
        "reviewDescription": "Chile!!! When I opened the package I wondered who's kindergarten body this was made for 🤔 ,BUT I tried it on anyway. I ordered the L/XL and I am a 12/14 (5'7\" & 186lbs) with 38DD breast and a nice lil fupa. Even though I had to squeeze into it, this shaper was actually comfortable to wear, offered breast support, and had me SNATCHED TO THE GAWDS 🙌🏾😍I seriously suggest you purchase it ASAP!!! (Follow the size chart)Gave 4 stars because it's a thong- I HATE THONGS 😡🤣",
        "isVerified": true,
        "variant": "Size: L/XLColor: Black Thong",
        "reviewImages": [],
        "position": 20
    },
    {
        "productAsin": "B0BXRZ3S7W",
        "ratingScore": 4,
        "reviewTitle": "If no pain no gain was an item",
        "reviewUrl": "https://www.amazon.com/gp/customer-reviews/R2ZW0GAA64CR08/ref=cm_cr_arp_d_rvw_ttl?ie=UTF8&ASIN=B0BXRZ3S7W",
        "reviewReaction": "7 people found this helpful",
        "reviewedIn": "Reviewed in the United States 🇺🇸 on April 16, 2023",
        "date": "2023-04-16",
        "country": "United States",
        "countryCode": "🇺🇸",
        "reviewDescription": "I’ve been researching different shapewear and I decided on this one because 1. It’s affordable 2. It’s the type I wanted (thong vs shorts) and 3. I was too indecisive and waited to long to order anything else and needed it to arrive before my vacation lolIt definitely supported my problem areas like I needed it too but it rolls up on my hips and was just real uncomfortable after wearing it all day walking in Vegas but I looked snatched so I bought 2 🤣I got M/L. For reference I’m 5’4 215 38DD and I carry all my weight in my boobs and fupa LOL",
        "isVerified": true,
        "variant": "Size: Small/MediumColor: Black Thong",
        "reviewImages": [],
        "position": 21
    },
    {
        "productAsin": "B0BXRZ3S7W",
        "ratingScore": 4,
        "reviewTitle": "Love it but the seam ripped..",
        "reviewUrl": "https://www.amazon.com/gp/customer-reviews/R2WHPG1ARP476W/ref=cm_cr_arp_d_rvw_ttl?ie=UTF8&ASIN=B0BXRZ3S7W",
        "reviewReaction": "40 people found this helpful",
        "reviewedIn": "Reviewed in the United States 🇺🇸 on March 15, 2023",
        "date": "2023-03-15",
        "country": "United States",
        "countryCode": "🇺🇸",
        "reviewDescription": "I’m giving this 4 stars bc the seam ripped slightly while I was trying it on & it was not bc it didn’t fit, I probably could have went a size down for more compression. However, I can sew so it was easier to repair it myself than to go thru the hoopla of returning & getting a replacement.It was super tiny right out of the package so I did not think it would fit BUT it went on without any struggle whatsoever and has a very comfortable smoothing effect.. seemed to even out my tummy nicely and somehow made my backside more shapely/rounded as well. I did notice the hips rolled up when I had panties on underneath but without them it seemed to grip my skin a little better. Might be an issue for fitted dresses but jeans/pants should hold it in place.Overall, it’s probably 1 of the best pieces of shapewear I own & I own A LOT! lol I think I’ll grab another in nude as well. For reference, my measurements are 40D, 33W, 48H. I’m 5’8” tall, curvy, & 230lbs. I purchased an XL/XXL & it fit perfectly.",
        "isVerified": true,
        "variant": "Size: L/XLColor: Black Thong",
        "reviewImages": [
            "https://m.media-amazon.com/images/I/61ZoX-1rhxL._SY88.jpg",
            "https://m.media-amazon.com/images/I/71ZG1UanzhL._SY88.jpg"
        ],
        "position": 22
    },
    {
        "productAsin": "B0BXRZ3S7W",
        "ratingScore": 4,
        "reviewTitle": "Pretty good!",
        "reviewUrl": "https://www.amazon.com/gp/customer-reviews/R1PMKYFDT0OUYC/ref=cm_cr_arp_d_rvw_ttl?ie=UTF8&ASIN=B0BXRZ3S7W",
        "reviewReaction": "53 people found this helpful",
        "reviewedIn": "Reviewed in the United States 🇺🇸 on April 6, 2023",
        "date": "2023-04-06",
        "country": "United States",
        "countryCode": "🇺🇸",
        "reviewDescription": "I liked this product. compared to other shape wear, this works really well for me. one thing i will say though is that if you are a curvy girl, a little bigger on the hips, the sides roll up. It’s not bad if you pull it down, but it can get irritating. also if you have a fatter coochie (🙋‍♀️) you have to pull it down too. when i saw the reviews i saw people wearing it so that the sides go above your hips, but i am wearing mine so it stops right at the hips. covers my bits and gives that smooth look. Other than that, i really like this. I sized down also. For reference i’m 5’3 and 180lbs. i got the sm/med.",
        "isVerified": true,
        "variant": "Size: Small/MediumColor: Black Thong",
        "reviewImages": [
            "https://m.media-amazon.com/images/I/71FHwX4qrnL._SY88.jpg",
            "https://m.media-amazon.com/images/I/71FIWbRNYpL._SY88.jpg",
            "https://m.media-amazon.com/images/I/71Suvm+p3lL._SY88.jpg",
            "https://m.media-amazon.com/images/I/71xhOHiV23L._SY88.jpg"
        ],
        "position": 23
    },
    {
        "productAsin": "B0BXRZ3S7W",
        "ratingScore": 4,
        "reviewTitle": "Great but see-through",
        "reviewUrl": "https://www.amazon.com/gp/customer-reviews/R28POBQP23AR9B/ref=cm_cr_arp_d_rvw_ttl?ie=UTF8&ASIN=B0BXRZ3S7W",
        "reviewReaction": "",
        "reviewedIn": "Reviewed in the United States 🇺🇸 on April 28, 2023",
        "date": "2023-04-28",
        "country": "United States",
        "countryCode": "🇺🇸",
        "reviewDescription": "I really wanted to love this, and it so comfy and butter soft. It just didn't work for me. It definitely smoothed the tummy  and made the breasts look great. However, it also settled into every little crease on my back and hips and was also so see-through. This would be a great suit to wear under clothing, I just wouldn't recommend if you were wanting to wear on it's own with shorts or jeans.",
        "isVerified": true,
        "variant": "Size: XXS/XSColor: Pink Thong",
        "reviewImages": [],
        "position": 24
    },
    {
        "productAsin": "B0BXRZ3S7W",
        "ratingScore": 5,
        "reviewTitle": "Best shape wear !",
        "reviewUrl": "https://www.amazon.com/gp/customer-reviews/RCBVB86N1C1JC/ref=cm_cr_arp_d_rvw_ttl?ie=UTF8&ASIN=B0BXRZ3S7W",
        "reviewReaction": "",
        "reviewedIn": "Reviewed in the United States 🇺🇸 on May 14, 2023",
        "date": "2023-05-14",
        "country": "United States",
        "countryCode": "🇺🇸",
        "reviewDescription": "I’m amazed how this shape wear help with my tummy. I always had issues in buying shape wears because it would only control the upper top of my stomach but with this one it holds all and it’s not so tight on you. You can wear it all day and it will not bother you . I have bought 2 already the tong one and the regular underwear one and I will be purchasing the short one soon !",
        "isVerified": true,
        "variant": "Size: XXS/XSColor: Beige Brief",
        "reviewImages": [],
        "position": 25
    },
    {
        "productAsin": "B0BXRZ3S7W",
        "ratingScore": 5,
        "reviewTitle": "Love it",
        "reviewUrl": "https://www.amazon.com/gp/customer-reviews/RL870O48YBJ3/ref=cm_cr_arp_d_rvw_ttl?ie=UTF8&ASIN=B0BXRZ3S7W",
        "reviewReaction": "2 people found this helpful",
        "reviewedIn": "Reviewed in the United States 🇺🇸 on May 4, 2023",
        "date": "2023-05-04",
        "country": "United States",
        "countryCode": "🇺🇸",
        "reviewDescription": "Now I was surprised when opening it ,it looked small even my husband and my sister doubt that I could fit it .I got L/XL im 5'3 and 230 pound. I wanted to try because I want that hour glass shape and the reviews seem promising . Sure enough it does fit,  dont be discouraged by the size of it out the package.It does stretch to your size I PROMISE. I've been reusing it for a while now ,it's still have coverage, smooth ,no lint ,and best of all give me confidence in public, so I ordered more in different colors :)",
        "isVerified": true,
        "variant": "Size: L/XLColor: Black Thong",
        "reviewImages": [],
        "position": 26
    },
    {
        "productAsin": "B0BXRZ3S7W",
        "ratingScore": 4,
        "reviewTitle": "meh",
        "reviewUrl": "https://www.amazon.com/gp/customer-reviews/R2X9XCY3T1HRD3/ref=cm_cr_arp_d_rvw_ttl?ie=UTF8&ASIN=B0BXRZ3S7W",
        "reviewReaction": "",
        "reviewedIn": "Reviewed in the United States 🇺🇸 on May 8, 2023",
        "date": "2023-05-08",
        "country": "United States",
        "countryCode": "🇺🇸",
        "reviewDescription": "I love this product… I do… but the reviews are a little wrong. I got a medium because most people said that you should buy your size but I feel like you should size down. I usually wear a medium in regular clothes but I feel like I could go a little smaller.",
        "isVerified": true,
        "variant": "Size: Small/MediumColor: Black Thong",
        "reviewImages": [],
        "position": 27
    },
    {
        "productAsin": "B0BXRZ3S7W",
        "ratingScore": 4,
        "reviewTitle": "I like it!",
        "reviewUrl": "https://www.amazon.com/gp/customer-reviews/RT9GNCRT91870/ref=cm_cr_arp_d_rvw_ttl?ie=UTF8&ASIN=B0BXRZ3S7W",
        "reviewReaction": "",
        "reviewedIn": "Reviewed in the United States 🇺🇸 on May 5, 2023",
        "date": "2023-05-05",
        "country": "United States",
        "countryCode": "🇺🇸",
        "reviewDescription": "Honestly I struggled to get it on at first or I may just need to go up a size next time, but once it was finally on it did look nice. It definitely smoothes you out and hides the chub in the abdomen/back area. The bottom is long enough that I can secure the snaps without struggling, which is amazing!",
        "isVerified": true,
        "variant": "Size: L/XLColor: Black Thong",
        "reviewImages": [],
        "position": 28
    },
    {
        "productAsin": "B0BXRZ3S7W",
        "ratingScore": 4,
        "reviewTitle": "Cuts in at the hips",
        "reviewUrl": "https://www.amazon.com/gp/customer-reviews/R14GMGYEBWNBW4/ref=cm_cr_arp_d_rvw_ttl?ie=UTF8&ASIN=B0BXRZ3S7W",
        "reviewReaction": "33 people found this helpful",
        "reviewedIn": "Reviewed in the United States 🇺🇸 on March 19, 2023",
        "date": "2023-03-19",
        "country": "United States",
        "countryCode": "🇺🇸",
        "reviewDescription": "I love this shape wear and will not be returning. The only issue I have is that it cuts me off in the hips, which can get uncomfortable. It also rolls up at the hips, and I’m constantly pulling it down, which is not easy when it’s under clothes.  It is providing me with motivation to lose a little more weight for it to fit better. It looks great otherwise, and the hooks at the crotch are nice and stretchy and easy to hook. There is also enough stretch to just pull the crotch to the side when doing your business, and the hooks don’t come undone when you don’t want them to. I wish ShaperX would come up with a gusset that doesn’t unhook, as I rarely use that feature, and would much prefer something more comfortable and covering in the gusset area. I am 5’0” and weigh 151 lb. I got the large size.",
        "isVerified": true,
        "variant": "Size: L/XLColor: Black Thong",
        "reviewImages": [],
        "position": 29
    },
    {
        "productAsin": "B0BXRZ3S7W",
        "ratingScore": 4,
        "reviewTitle": "Skims dupe!",
        "reviewUrl": "https://www.amazon.com/gp/customer-reviews/R3677NWRGM5NZ4/ref=cm_cr_arp_d_rvw_ttl?ie=UTF8&ASIN=B0BXRZ3S7W",
        "reviewReaction": "14 people found this helpful",
        "reviewedIn": "Reviewed in the United States 🇺🇸 on April 12, 2023",
        "date": "2023-04-12",
        "country": "United States",
        "countryCode": "🇺🇸",
        "reviewDescription": "You need to ask a friend to help get this on because it is tight!! Do not size down, get your normal size. I am a 32 bust, 30 waist, 40 hip and the S/M fits well. Once it’s in position it’s not compressive-feeling. I would rate this 5 stars if the bra portion was more supportive. I got the black to go under and over clothing but I realized I don’t want it to show under dresses so I just ordered the nude as well. First picture is with the shape wear , second picture is without.",
        "isVerified": true,
        "variant": "Size: Small/MediumColor: Black Thong",
        "reviewImages": [
            "https://m.media-amazon.com/images/I/6113tn3XBwL._SY88.jpg",
            "https://m.media-amazon.com/images/I/61K4tF-jruL._SY88.jpg",
            "https://m.media-amazon.com/images/I/61pOlzlCwfL._SY88.jpg"
        ],
        "position": 30
    }
]